Revit 2026 API

# PlanarFaceXVector Property

---

The X-vector of the planar face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ XVector { get; }
```
```vb
Public ReadOnly Property XVector As XYZ
	Get
```
```cpp
public:
property XYZ^ XVector {
	XYZ^ get ();
}
```
```fsharp
member XVector : XYZ with get
```

#### Property Value

XYZ

Note that the cross product of X-vector and Y-vector may result in the reverse of the FaceNormal vector depending upon how Revit has structured this particular face.

#### Reference

PlanarFace Class

Autodesk.Revit.DB Namespace